/*
1. Дано змінні a і b. Перевірте, що "a" ділиться без залишку на "b". 
Якщо це так - виведіть 'Ділиться' і результат поділу, інакше виведіть 'Ділиться з залишком' та залишок від поділу.
 */
$a = 2;
$b = 3;
if($a % $b == 0 && $b !=0){
console.log ("Ділиться");
}else{
console.log ("Ділиться з залишком");
}
/*
2. "Намалюйте" в консолі прямокутний трикутник із зірочок (або плюсиків, або якогось іншого символу): на першому рядку - одна зірочка, на другому дві, і так далі. 
Рішення оформіть у вигляді функції, куди передаються два параметри: висота трикутника та символ, яким його потрібно "малювати".
 */
var lines = 5;
var str = " ";
var star = "*";
for (var i = 0; i < lines; i++) {
  str += star;
  console.log(str);
}
/*
3. Виведіть в консоль непарні числа у проміжку від 0 до 100.
 */
for (let i = 0; i < 100; i += 1) {
if (i % 2 !== 0) {
    console.log(i);
    }
  }
/*
4. Дано число n = 1000. Поділіть його на 2 стільки разів, поки результат поділу не буде меньше 50. Яке число вийде? 
Порахуйте кількість ітерацій, необхідних для цього.
 */
let Num = 0;
let n = 1000;
while ( n > 50) {
    n /=2;
    Num++;
}
console.log('Результат поділу =', n);
console.log('Кількість ітерацій =', Num);
/*
Результат поділу: 31.25
Кількість ітерацій: 5
 */