

//Дано змінні a і b. Перевірте, що "a" ділиться без залишку на "b". 
//Якщо це так - виведіть 'Ділиться' і результат поділу, інакше виведіть 'Ділиться з залишком' та залишок від поділу.
/*
var a = 5
var b = 5
if (b == 0) {
console.log("Shame on you!")

}
else {
var res = a%b
if (a >= b) {
if (res == 0)
{
    console.log("Ділиться")
    console.log (a/b)
}
    else
    {
        console.log("Ділиться з залишком")
        console.log(res)
    }
}
else {console.log("'a' має бути більше, або дорівнювати 'b'")}
}
*/




/*"Намалюйте" в консолі прямокутний трикутник із зірочок (або плюсиків, або якогось іншого символу): 
на першому рядку - одна зірочка, на другому дві, і так далі. 
Рішення оформіть у вигляді функції, куди передаються два параметри: 
висота трикутника та символ, яким його потрібно "малювати".*/
/*
var row = 3
var str = " ";
var sym = "*"
//drawTriangle(row,sym); 
if (row <= 0)
{
    console.log("Кількісь рядків має буди більше нуля")
}
    else {
        for (var line = 1; line <= row; line++)
      			{
            str += sym;
            console.log(str)
        		}
        }
*/


//Виведіть в консоль непарні числа у проміжку від 0 до 100.
/*var count = 0
var par = 0
//var npar = 0
for (var count = 1; count <=100; count++)
{
    par = count%2
    if (par != 0)
    {
        console.log(count)
    }
    else { }
}
*/
//Дано число n = 1000. Поділіть його на 2 стільки разів, поки результат поділу не буде меньше 50. 
//Яке число вийде? Порахуйте кількість ітерацій, необхідних для цього.

/*Дано число n = 1000. Поділіть його на 2 стільки разів, 
поки результат поділу не буде меньше 50. 
Яке число вийде? Порахуйте кількість ітерацій, необхідних для цього.

var n = 1000;
for (i=0; n >= 50; i++) {
  n /= 2;
}

console.log("Кількість ітерацій: ", i);
console.log("Результат: ", n);*/